In [2]:
import pandas as pd
df= pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df.head()

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
import pandas as pd
df= pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A","B","C"])
print(df.head())
print(df.values)
print(df.columns)
print(df.index)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
[[1 2 3]
 [4 5 6]
 [7 8 9]]
Index(['A', 'B', 'C'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

In [4]:
print(df.tail(1))

print(df.head(1))

print(df.tail(2))

   A  B  C
2  7  8  9
   A  B  C
0  1  2  3
   A  B  C
1  4  5  6
2  7  8  9

In [5]:
df.index.tolist()

[0, 1, 2]

In [6]:
df= pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A","B","C"], index=["x","y","z"])
df

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [7]:
print(df.info())
print("*********************DESCRIBE********************")
print(df.describe())
print("****************UNIQuE*****************")
print(df.nunique())
print("****************UNIDQE PERTICULAR*****************")
print(df['A'].unique())
print("****************shape*****************")
print(df.shape)
print("****************size*****************")
print(df.size)

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes
None
*********************DESCRIBE********************
         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0
****************UNIQuE*****************
A    3
B    3
C    3
dtype: int64
****************UNIDQE PERTICULAR*****************
[1 4 7]
****************shape*****************
(3, 3)
****************size*****************
9

In [43]:
coffee=pd.read_csv('./warmup-data/coffee.csv')
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [3]:
results=pd.read_parquet('./warmup-data/results.parquet')
bios=pd.read_csv('./warmup-data/bios.csv')

In [5]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [16]:
print(coffee.loc[[1,2,5]])
print("*********************************************")
print([[1,3,6],["Day"]])
print("*********************************************")
print(coffee.loc[1:3])
print("*********************************************")
print(coffee.loc[5:8,["Day","Units Sold"]])
print("*********************************************")

         Day Coffee Type  Units Sold
1     Monday       Latte          15
2    Tuesday    Espresso          30
5  Wednesday       Latte          25
*********************************************
[[1, 3, 6], ['Day']]
*********************************************
       Day Coffee Type  Units Sold
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20
*********************************************
         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
*********************************************

In [18]:
coffee.iloc[5:8,[1,2]]

  Coffee Type  Units Sold
5       Latte          25
6    Espresso          40
7       Latte          30

In [32]:
coffee.index=coffee["Coffee Type"]
print(coffee.loc["Latte"])
print("*********************************************")
print(coffee.loc["Latte","Day"])
print("*********************************************")
print(coffee.loc[["Latte","Espresso"],"Day"])

                   Day Coffee Type  Units Sold
Coffee Type
Latte           Monday       Latte          15
Latte          Tuesday       Latte          20
Latte        Wednesday       Latte          25
Latte         Thursday       Latte          30
Latte           Friday       Latte          35
Latte         Saturday       Latte          35
Latte           Sunday       Latte          35
*********************************************
Coffee Type
Latte       Monday
Latte      Tuesday
Latte    Wednesday
Latte     Thursday
Latte       Friday
Latte     Saturday
Latte       Sunday
Name: Day, dtype: object
*********************************************
Coffee Type
Latte          Monday
Latte         Tuesday
Latte       Wednesday
Latte        Thursday
Latte          Friday
Latte        Saturday
Latte          Sunday
Espresso       Monday
Espresso      Tuesday
Espresso    Wednesday
Espresso     Thursday
Espresso       Friday
Espresso     Saturday
Espresso       Sunday
Name: Day, dtype: object

In [38]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [41]:
coffee.loc[1:3,"Units Sold"] = 10

In [42]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [47]:
# Rerun coffee.csv file to get the original values 
print(coffee.at[0,"Units Sold"])
print(coffee.iat[2,0])
print(coffee.iloc[2,0])

25
Tuesday
Tuesday

In [48]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [49]:
bios.loc[bios["height_cm"]>215,["name","height_cm"]]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [51]:
bios[bios["height_cm"]>217][["name","height_cm"]]

                       name  height_cm
5089     Viktor Pankrashkin      220.0
5673         Gunther Behnke      221.0
5716               Uwe Blab      218.0
5781         Tommy Burleson      223.0
5796          Andy Campbell      218.0
6420          Jānis Krūmiņš      218.0
6504            Luc Longley      220.0
6978        Arvydas Sabonis      223.0
7188     Vladimir Tkachenko      220.0
7376    Eurelijus Žukauskas      218.0
82100         Frédéric Weis      218.0
89070              Yao Ming      226.0
89075        Roberto Dueñas      221.0
107408     Peter John Ramos      219.0
112337        Hamed Haddadi      218.0
118676      Dmitry Musersky      219.0
120266         Zhang Zhaoxu      221.0
130460             Li Muhao      218.0
139365       Moustapha Fall      218.0

In [52]:
bios[(bios["height_cm"]>215) & (bios["born_country"]=="USA")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

In [55]:
bios[(bios["height_cm"]>215) & (bios["born_country"]=="USA")][["name","height_cm","weight_kg","born_country"]]

                    name  height_cm  weight_kg born_country
5781      Tommy Burleson      223.0      102.0          USA
6722    Shaquille O'Neal      216.0      137.0          USA
6937      David Robinson      216.0      107.0          USA
123850    Tyson Chandler      216.0      107.0          USA

In [57]:
bios[bios["name"].str.contains("Keith")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [ ]:
print(bios[bios["name"].str.contains("keith")])# case sensitive
print("///////////////////////////////////////////////////// \n\n")
print(bios[bios["name"].str.contains("keith",case=False)])

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []
/////////////////////////////////////////////////////


        athlete_id                  name   born_date         born_city  \
1897          1907          Keith Hanlon  1966-09-01               NaN
3505          3517         Keith Wallace  1961-03-29           Preston
6228          6255         Keith Hartley  1940-10-15         Vancouver
8898          8946           Keith Mwila  1966-01-01               NaN
12053        12118          Keith Hervey  1898-11-03            Fulham
...            ...                   ...         ...               ...
109900      111105     Keith Cumberpatch  1927-08-25      Christchurch
115973      117348       Keith Sanderson  1975-02-02          Plymouth
117676      119195          Duncan Keith  1983-07-16          Winnipeg
122121      124176        Keith Ferguson  1979-09-07              Sale
127310      129749  Tracy Keith-Matchitt  1990-03-30  Palmerston North

              born_region born_country            NOC  height_cm  weight_kg  \
1897                  NaN          NaN        Ireland        NaN        NaN
3505              England          GBR  Great Britain      165.0       51.0
6228     British Columbia          CAN         Canada      200.0       85.0
8898                  NaN          NaN         Zambia        NaN        NaN
12053             England          GBR  Great Britain        NaN        NaN
...                   ...          ...            ...        ...        ...
109900         Canterbury          NZL    New Zealand        NaN        NaN
115973      Massachusetts          USA  United States      183.0       95.0
117676           Manitoba          CAN         Canada      185.0       88.0
122121           Victoria          AUS      Australia      176.0       78.0
127310  Manawatu-Wanganui          NZL   Cook Islands      167.0       60.0

         died_date
1897           NaN
3505    1999-12-31
6228           NaN
8898    1993-01-09
12053   1973-02-22
...            ...
109900  2013-11-15
115973         NaN
117676         NaN
122121         NaN
127310         NaN

[70 rows x 10 columns]